In [1]:
import pandas as pd

In [23]:
hr = pd.read_csv("hapiness_report_2022.csv")

In [24]:
hr.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 146 entries, 0 to 145
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   country  146 non-null    object
 1   score    146 non-null    float64
 2   income   140 non-null    object
dtypes: float64(1), object(2)
memory usage: 3.6+ KB

In [25]:
hr.head(5)

       country  score       income
0      Finland  7.821  High income
1      Denmark  7.636  High income
2      Iceland  7.557  High income
3  Switzerland  7.512  High income
4  Netherlands  7.415  High income

In [26]:
hr

         country  score               income
0        Finland  7.821          High income
1        Denmark  7.636          High income
2        Iceland  7.557          High income
3    Switzerland  7.512          High income
4    Netherlands  7.415          High income
..           ...    ...                  ...
141     Botswana  3.471  Upper middle income
142       Rwanda  3.268           Low income
143     Zimbabwe  2.995  Lower middle income
144      Lebanon  2.955  Lower middle income
145  Afghanistan  2.404           Low income

[146 rows x 3 columns]

In [27]:
hr.columns

Index(['country', 'score', 'income'], dtype='object')

In [28]:
hr.shape

(146, 3)

In [29]:
#hr['score'] = hr['score'].astype('int')

In [30]:
#hr['score'] = hr['score'].astype('float')

In [31]:
hr['income'].isna()

0      False
1      False
2      False
3      False
4      False
       ...
141    False
142    False
143    False
144    False
145    False
Name: income, Length: 146, dtype: bool

In [32]:
hr[hr['income'].isna()]

            country  score income
25           Taiwan  6.512    NaN
78     North Cyprus  5.467    NaN
87      Ivory Coast  5.235    NaN
98   Congo Kinshasa  5.075    NaN
107       Venezuela  4.925    NaN
121       Palestine  4.483    NaN

In [33]:
hr['country']=='Nigeria'

0      False
1      False
2      False
3      False
4      False
       ...
141    False
142    False
143    False
144    False
145    False
Name: country, Length: 146, dtype: bool

In [34]:
hr[hr['country']=='Nigeria']

     country  score               income
117  Nigeria  4.552  Lower middle income

In [36]:
#.max to view the higest 'score' vaule
hr['score'].max()

7.821

In [37]:
hr[hr['score']==(7.821)]

   country  score       income
0  Finland  7.821  High income

In [38]:
# this is used to remove columns or cell that's not a number applicable(na)
hr.dropna()

         country  score               income
0        Finland  7.821          High income
1        Denmark  7.636          High income
2        Iceland  7.557          High income
3    Switzerland  7.512          High income
4    Netherlands  7.415          High income
..           ...    ...                  ...
141     Botswana  3.471  Upper middle income
142       Rwanda  3.268           Low income
143     Zimbabwe  2.995  Lower middle income
144      Lebanon  2.955  Lower middle income
145  Afghanistan  2.404           Low income

[140 rows x 3 columns]

In [39]:
# this is used to remove columns or cell that's not a number applicable(na) permanantly
hr.dropna(inplace=True)

In [40]:
# to save the cell am removing
hwn = df.dropna()

In [41]:
hr.to_csv('hwn.csv')